bbetter173/AugmentOS/mcu_client/nrf5340_ble_simulator/src/main.c
/*
 * Copyright (c) 2018 Nordic Semiconductor ASA
 *
 * SPDX-License-Identifier: LicenseRef-Nordic-5-Clause
 */

/** @file
 *  @brief Nordic UART Bridge Service (NUS) sample
 */
#include <uart_async_adapter.h>

#include <zephyr/types.h>
#include <zephyr/kernel.h>
#include <zephyr/drivers/uart.h>
#include <zephyr/usb/usb_device.h>

#include <zephyr/device.h>
#include <zephyr/devicetree.h>
#include <zephyr/drivers/display.h>
#include <zephyr/drivers/gpio.h>
#include <soc.h>

#include <zephyr/bluetooth/bluetooth.h>
#include <zephyr/bluetooth/uuid.h>
#include <zephyr/bluetooth/gatt.h>
#include <zephyr/bluetooth/hci.h>

#include "mentra_ble_service.h"
#include "protobuf_handler.h"
#include "pdm_audio_stream.h"
#include "bsp_log.h"
#include "mos_lvgl_display.h"  // Working LVGL display integration
// #include "display/lcd/a6n.h"  // Working A6N driver
#include "opt3006.h"  // OPT3006 ambient light sensor
#include "lsm6dsv16x.h"  // LSM6DSV16X 6-axis IMU sensor

#include <dk_buttons_and_leds.h>

#include <zephyr/settings/settings.h>

#include <stdio.h>
#include <string.h>
#include <stdbool.h>

#include <zephyr/logging/log.h>
#include <zephyr/logging/log_ctrl.h>
#include <nrfx_clock.h>
#include <hal/nrf_usbreg.h>
#include <zephyr/irq.h>

#include "mos_fuel_gauge.h"
#include "opt3006.h"
#include "npm1300_led.h"

LOG_MODULE_REGISTER(main, LOG_LEVEL_DBG);

#define STACKSIZE 2048
#define PRIORITY 7

#define DEVICE_NAME CONFIG_BT_DEVICE_NAME
#define DEVICE_NAME_LEN	(sizeof(DEVICE_NAME) - 1)

#define RUN_STATUS_LED DK_LED1
#define RUN_LED_BLINK_INTERVAL 1000

#define CON_STATUS_LED DK_LED2

#define KEY_PASSKEY_ACCEPT DK_BTN1_MSK
#define KEY_PASSKEY_REJECT DK_BTN2_MSK

// **NEW: Updated button mappings to avoid SPI pin conflicts (P0.08/P0.09)**
#define KEY_BATTERY_CYCLE DK_BTN1_MSK           // Button 1: Cycle battery 0-100% + toggle charging
#define KEY_SCREEN_TOGGLE DK_BTN2_MSK           // Button 2: Cycle LVGL test patterns
#define KEY_PATTERN_CYCLE (DK_BTN1_MSK | DK_BTN2_MSK)  // Button 1+2: Cycle LVGL patterns

// **DISABLED: Buttons 3 & 4 conflict with SPI4 pins (P0.08 SCK, P0.09 MOSI)**
// #define KEY_BUTTON3 DK_BTN3_MSK              // P0.08 - conflicts with SPI4 SCK
// #define KEY_BUTTON4 DK_BTN4_MSK              // P0.09 - conflicts with SPI4 MOSI

#define UART_BUF_SIZE 240
#define UART_WAIT_FOR_BUF_DELAY K_MSEC(50)
#define UART_WAIT_FOR_RX 50

static K_SEM_DEFINE(ble_init_ok, 0, 1);

static struct bt_conn *current_conn;
static struct bt_conn *auth_conn;
static struct k_work adv_work;

/* USB cable detection using polling mode / USB线缆检测使用轮询模式 */
static struct k_work_delayable usb_detect_work;
static bool usb_connected = false;
#define USB_DETECT_POLL_INTERVAL_MS 1000  /* Poll every 1 second / 每1秒轮询一次 */

static const struct device *uart = DEVICE_DT_GET(DT_CHOSEN(nordic_nus_uart));
static struct k_work_delayable uart_work;

struct uart_data_t {
	void *fifo_reserved;
	uint8_t data[UART_BUF_SIZE];
	uint16_t len;
};
static uint16_t payload_mtu   = 20;
static bool     ble_connected = false; 
static struct bt_conn *my_current_conn;
static K_FIFO_DEFINE(fifo_uart_tx_data);
static K_FIFO_DEFINE(fifo_uart_rx_data);

static char dynamic_device_name[32] = "Nex1";
static struct bt_data ad[] = {
	BT_DATA_BYTES(BT_DATA_FLAGS, (BT_LE_AD_GENERAL | BT_LE_AD_NO_BREDR)),
	BT_DATA(BT_DATA_NAME_COMPLETE, "NexSim", 6),
};
static struct bt_data sd[] = {
	BT_DATA_BYTES(BT_DATA_UUID128_ALL, BT_UUID_MENTRA_VAL),
};
/**
 * @brief USB cable connected callback
 * USB线缆连接回调函数
 */
static void usb_cable_connected(void)
{
	LOG_INF("🔌 USB cable connected / USB线缆已连接");
	usb_connected = true;
	
	/* Display USB status on A6N screen / 在A6N屏幕上显示USB状态 */
	display_update_xy_text(350, 20, "[USB: ON]", 48, 0xFFFFFF);
}

/**
 * @brief USB cable disconnected callback
 * USB线缆断开回调函数
 */
static void usb_cable_disconnected(void)
{
	LOG_INF("🔌 USB cable disconnected / USB线缆已断开");
	usb_connected = false;
	
	/* Display USB status on A6N screen / 在A6N屏幕上显示USB状态 */
	display_update_xy_text(350, 20, "[USB: OFF]", 48, 0xFFFFFF);
}

/**
 * @brief USB detection work handler (polling mode)
 * USB检测工作处理函数（轮询模式）
 * 
 * Periodically polls the USBREGULATOR status register to detect
 * USB cable insertion/removal.
 * 
 * 定期轮询USBREGULATOR状态寄存器以检测USB线缆插拔。
 */
static void usb_detect_work_handler(struct k_work *work)
{
	uint32_t status = nrf_usbreg_status_get(NRF_USBREGULATOR_NS);
	bool current_vbus = (status & NRF_USBREG_STATUS_VBUSDETECT_MASK) != 0;

	if (current_vbus && !usb_connected)
	{
		usb_cable_connected();
	}
	else if (!current_vbus && usb_connected)
	{
		usb_cable_disconnected();
	}

	/* Schedule next poll / 安排下次轮询 */
	k_work_schedule(&usb_detect_work, K_MSEC(USB_DETECT_POLL_INTERVAL_MS));
}

/**
 * @brief Initialize USB cable detection (polling mode)
 * 初始化USB线缆检测（轮询模式）
 * 
 * Initializes USB cable detection using polling mode.
 * 初始化USB线缆检测，使用轮询模式。
 * 
 * @return 0 on success, negative error code on failure
 */
static int usb_detect_init(void)
{
	LOG_INF("🔌 Initializing USB cable detection (polling mode) / 初始化USB线缆检测（轮询模式）");
	LOG_INF("Polling interval: %d ms / 轮询间隔: %d毫秒", 
		USB_DETECT_POLL_INTERVAL_MS, USB_DETECT_POLL_INTERVAL_MS);
	
	/* Initialize delayed work for polling / 初始化延迟工作用于轮询 */
	k_work_init_delayable(&usb_detect_work, usb_detect_work_handler);
	
	/* Check initial USB cable state and display on screen / 检查初始USB线缆状态并显示在屏幕上 */
	uint32_t status = nrf_usbreg_status_get(NRF_USBREGULATOR_NS);
	
	if (status & NRF_USBREG_STATUS_VBUSDETECT_MASK)
	{
		usb_connected = true;
		LOG_INF("🔌 USB cable already connected / USB线缆已连接");
		/* Display initial status on A6N screen / 在A6N屏幕上显示初始状态 */
		display_update_xy_text(350, 20, "[USB: ON]", 48, 0xFFFFFF);
	}
	else
	{
		usb_connected = false;
		LOG_INF("🔌 USB cable not connected / USB线缆未连接");
		/* Display initial status on A6N screen / 在A6N屏幕上显示初始状态 */
		display_update_xy_text(350, 20, "[USB: OFF]", 48, 0xFFFFFF);
	}
	
	/* Start polling / 开始轮询 */
	k_work_schedule(&usb_detect_work, K_MSEC(USB_DETECT_POLL_INTERVAL_MS));
	
